set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT2]] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT0]]
set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT2]] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT2]] -to [get_clocks sys_clk_pin]
set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT0]] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT2]]
set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT0]] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT1]]
set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT0]] -to [get_clocks sys_clk_pin]
set_false_path -from [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT1]] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT2]]
set_false_path -from [get_clocks sys_clk_pin] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT2]]
set_false_path -from [get_clocks sys_clk_pin] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT0]]
set_false_path -from [get_clocks sys_clk_pin] -to [get_clocks -of_objects [get_pins clks_rst_1/mmcm_adv_inst/CLKOUT1]]
set_input_delay -clock [get_clocks sys_clk_pin] -min -add_delay 2.100 [get_ports {SW[*]}]
set_input_delay -clock [get_clocks sys_clk_pin] -max -add_delay 8.100 [get_ports {SW[*]}]
set_input_delay -clock [get_clocks sys_clk_pin] -min -add_delay 2.100 [get_ports CPU_RESETN]
set_input_delay -clock [get_clocks sys_clk_pin] -max -add_delay 8.100 [get_ports CPU_RESETN]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports {AN[*]}]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports {AN[*]}]
set_false_path -to [get_ports {AN[*]}]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CA]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CA]
set_false_path -to [get_ports CA]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CB]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CB]
set_false_path -to [get_ports CB]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CC]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CC]
set_false_path -to [get_ports CC]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CD]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CD]
set_false_path -to [get_ports CD]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CE]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CE]
set_false_path -to [get_ports CE]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CF]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CF]
set_false_path -to [get_ports CF]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports CG]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports CG]
set_false_path -to [get_ports CG]
set_output_delay -clock [get_clocks sys_clk_pin] -min -add_delay -1.900 [get_ports DP]
set_output_delay -clock [get_clocks sys_clk_pin] -max -add_delay 6.100 [get_ports DP]
set_false_path -to [get_ports DP]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks {clk_out_37p5 clk_out_50}] -group [get_clocks -include_generated_clocks clk_out_33]
set_clock_groups -logically_exclusive -group [get_clocks -include_generated_clocks clk_out_50] -group [get_clocks -include_generated_clocks clk_out_37p5]
